In [2]:
# Code for Module 5 of UT Bootcamp - PyBer Ridesharing scenario
# Curriculum Exercises for Sections 5.2.1 to 5.7.3

In [4]:
# Add Matplotlib for displaying in Jupyter Notebook
# dependencies and setup
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd

In [20]:
city_data_df = pd.read_csv("Resources/city_data.csv")
ride_data_df = pd.read_csv("Resources/ride_data.csv")
print(city_data_df.shape)
city_data_df.head()

(120, 3)

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [21]:
print(ride_data_df.shape)
ride_data_df.head()

(2375, 4)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [19]:
# Check for null values, data types of columns, etc.
print("City Data Dataframe")
print(city_data_df.isna().sum())
print(city_data_df.dtypes)
#print(city_data_df["type"].unique())
print(city_data_df["type"].value_counts())
print(city_data_df["city"].value_counts())
print("\n\nRide Data Dataframe")
print(ride_data_df.isna().sum())
print(ride_data_df.dtypes)
print(ride_data_df["city"].value_counts())

City Data Dataframe
city            0
driver_count    0
type            0
dtype: int64
city            object
driver_count     int64
type            object
dtype: object
Urban       66
Suburban    36
Rural       18
Name: type, dtype: int64
South Saramouth       1
North Holly           1
West Hannah           1
New Paulton           1
Bradshawfurt          1
                     ..
West Ericstad         1
Grayville             1
Loganberg             1
Lake Ann              1
Port Samanthamouth    1
Name: city, Length: 120, dtype: int64


Ride Data Dataframe
city       0
date       0
fare       0
ride_id    0
dtype: int64
city        object
date        object
fare       float64
ride_id      int64
dtype: object
West Angela        39
South Karenland    38
North Jason        35
Port Frank         33
Liumouth           33
                   ..
Randallchester      5
Penaborough         5
Newtonview          4
South Saramouth     4
Garzaport           3
Name: city, Length: 120, dtype: int64

In [22]:
# Merge data 
pyber_data = pd.merge(ride_data_df, city_data_df, how='left',on=['city','city'])
pyber_data.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban